#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
#+TITLE: Ye Olde (Literate) SVEIRD Model (optionally with BDA)
#+AUTHOR: Bryce Carson
# Copyright © 2024 Bryce Carson

This is a literate version of the SVEIRD "raster" simulation with Bayesian data assimilation.

*** Remove all dead code
The organization of the old code in a single file with poor commenting practices
makes understanding the code difficult at times. To make the literate program
more understandable, comments of various types have been removed, which makes
the diff of the two files non-equivalent unless comments are ignored.

If you have never seen a diff before, [[http://www.pixelbeat.org/programming/diffs/][check out this webpage]].

#+begin_src bash :exports both :eval yes :shebang #!/usr/bin/env bash :results verbatim
  removecomments() {
    awk '!/^\s+?#/' "$1"
  }

  FILE_A=$(mktemp)
  FILE_B=$(mktemp)
  removecomments rasterSimulation_DA.R > "$FILE_A"
  removecomments literateRasterSimulationWithDA.R > "$FILE_B"
  if diff --ignore-all-space "$FILE_A" "$FILE_B"; then
    echo "Equivalent";
  fi
#+end_src

#+RESULTS:
#+begin_example diff
273d272
< 
276,277c275
<   for (t in 1:timestep)
<   {					# time increments
---
> for (t in 1:timestep) {
288d285
< 
313d309
< 
322d317
< 
336d330
< 
342d335
< 
529a523
> 
531c525
<   }   # time increments
---
> }
572d565
< 
#+end_example

* =distwtRaster.R= The Euclidian distance weight matrix function
The file =distwtRaster.R= defines a function =wtd_nbrs_sum=, which calculates a
matrix of values which are weighted sums of values at every cell. The full
source of that file is reproduced here for discussion and analysis.

This sections exists to analyze the reason for the cause of the issue witnessed
in [[Generating the ~I_tilda~ matrix]].

#+begin_comment
,#+begin_quote
This code sets the Euclidean distance and the weight matrix
,#+end_quote

The above quote is a comment on the file when it is sourced in [[source
dependencies]]. The commend doesn't make much sense to me because it does not
"set" a Euclidian distance nor does it "set" a weighted sum in any one variable.
It returns a matrix of values which are weighted sums of values of functions of
the Euclidean distance from a given cell to another cell.
#+end_comment

The average euclidean distance function is implemented as follows in the
original code.

\[
  \displaystyle
  \exp\left( -1 *
    \frac{
      \left(\sum\left(p-q\right)^2\right)^{\frac{1}{2}}
    }{\lambda}
  \right)
\]

#+begin_src R :session *eg*
  avg_euclidean_distance <- function(p, q, lambda)
  {
    exp(-sqrt(sum((p - q)^2))/lambda)
  }
#+end_src

How it is applied, with \(p, q\) being ~c(i,j)~ and ~c(radius+1, radius+1)~,
respectively, is odd in my mind, however.
#+begin_comment
# The remainder of this paragraph was incorrect. The results are okay.
Not only is it odd, it is incorrectly applied for even one dimension, for which
the formula applies. [[https://en.wikipedia.org/wiki/Euclidean_distance#Two_dimensions][We are using two dimensions!]] The point p and the point q
are not separated on just one dimension, but two \(x, y\)!
#+end_comment
I test here the original code and compare it to a slighly modification.

Here is a block to test the original code.

#+name: test the original algorithm in avg_euclidean_distance
#+begin_src R :session *eg* :export both
  library(spatstat.random)

  aed <- function(p, q, lambda) {
    exp(-sqrt((p$x - q$x)^2 + (p$y - q$y)^2)/lambda)
  }

  points <- runifpoint(10, owin(c(0,100), c(0,100)))

  ## Assuming each unit is 5 km, and lambda is (15 km / day) / (5km / cell) = 3 cell / day
  print(aed(points[1], points[2], 3))
#+end_src

#+RESULTS:
: 2.43887270488085e-10

The results of the two slightly different functions are compared for a number of
inputs for verification.

#+name: compare the vectorized and unvectorized form of avg_euclidean_distance
#+begin_src R :session *eg* :export both
  p <- c(points[1]$x, points[1]$y)
  q <- c(points[2]$x, points[2]$y)
  avg_euclidean_distance(p, q, 3)

  avg_euclidean_distance(p, q, 3) == aed(points[1], points[2], 3)
#+end_src

#+RESULTS:
: TRUE

The original code can't handle the class of object I'm using from the
/spatstat.random/ package, of course, which is not expected. It wasn't meant to
handle *any* object type, just numerics. That's not a problem. I saw a potential
problem with ~(p - q)^2~ for vectors, but it looks like it is handled correctly
when using vectors (which suprises me)! Having verified that passing vectors as
\(p, q\) is acceptable I can move on to test other aspects of =wtd_nmbr_sum=
function.

#+name: wtd_nbrs_sum
#+begin_src R
  wtd_nbrs_sum <- function(input_matrix, radius, lambda) {
    temp_1 <- matrix(data = 0, nrow = nrow(x = input_matrix), ncol = radius)
    temp_2 <- matrix(data = 0, nrow = radius, ncol = ((2 * radius) + ncol(x = input_matrix)))
    input_matrix_modified <- rbind(temp_2, cbind(temp_1, input_matrix, temp_1), temp_2)
    output_matrix <- matrix(nrow = nrow(x = input_matrix), ncol = ncol(x = input_matrix))

    ## Generating the weight matrix
    weight_matrix <- matrix(0, nrow = 1 + 2*radius, ncol = 1 + 2*radius)
    for(i in seq_len(1 + 2*radius)) {
      for(j in seq_len(1 + 2*radius)) {
        weight_matrix[i,j] <- avg_euclidean_distance(c(i,j), c(radius+1, radius+1), lambda)
      }
    }

    for(i in seq_len(length.out = nrow(x = input_matrix))) {
      for(j in seq_len(length.out = ncol(x = input_matrix))) {
        row_min <- (radius + (i - radius))
        row_max <- (radius + (i + radius))
        column_min <- (radius + (j - radius))
        column_max <- (radius + (j + radius))
        neighbours <- input_matrix_modified[(row_min:row_max), (column_min:column_max)]
        weighted_sum <- sum(neighbours * weight_matrix) # casewise multiplication
        output_matrix[i, j] <- weighted_sum
      }
    }

    return(output_matrix)
  }
#+end_src

The conclusion of this section, then, is that the ~avg_euclidean_distance~
function was fine, it was just ~wtd_nbrs_sum~ that was bad.

* An R session loading the new code package for use with comparisons :noexport:
This section is not exported to other backends (PDF, HTML, etc.); it would still
be visible on GitHub, as GitHub only does a minimal fancy display of Org files,
but does not render them or support all Org features and syntax.

#+begin_src R :session *foundation*
  library(tidyverse)
  library(terra)
  library(spatialEpisim.foundation)
#+end_src

#+RESULTS:
| sf                       |
| sp                       |
| rstudioapi               |
| rasterVis                |
| magick                   |
| lattice                  |
| fasterize                |
| cptcity                  |
| countrycode              |
| av                       |
| spatialEpisim.foundation |
| terra                    |
| lubridate                |
| forcats                  |
| stringr                  |
| dplyr                    |
| purrr                    |
| readr                    |
| tidyr                    |
| tibble                   |
| ggplot2                  |
| tidyverse                |
| stats                    |
| graphics                 |
| grDevices                |
| datasets                 |
| drat                     |
| devtools                 |
| usethis                  |
| utils                    |
| methods                  |
| base                     |
